[{
	"title": "Introduction",
	"text": "Although Reversi can be played on any size board the standard game uses a board with 64 squares (8x8). The opening position is shown in the diagram. The usual way of labelling the board is A-H along the top and 1-8 down the side. Using this method we can refer to any square by the use of a letter and a number. For example, the top left square is A1 and the bottom right square is H8. Each reversi disc is black on one side and white on the other. Black always plays first and places a disc, black side uppermost, on any square on the board such that he 'traps' at least one of his opponents pieces between the disc he has just placed and any other of his colour already on the board. Black's possible opening moves are shown as 'x' in the diagram. If, for example, black opens with F5, he has trapped the white disc at E5 between the piece he has just played (F5) and another black piece already on the board (D5). The white disc at E5 is flipped to show the black side uppermost.",
	"image": "stboard.gif"
}, {
	"title": "Moves and Flipping Pieces",
	"text": "The diagram shows a game in play. It is white to move and all possible moves are numbered. It is possible to flip several discs on a single turn. For example, a white move at 6 flips the black discs at C4, D4, E4, F4 and G4. You can flip discs horizontally, vertically or diagonally. For example, a white move at 1 flips the black discs at C3 and D4. It is even possible to flip discs in more than one direction on a single move. For example, a white move at 10 flips the black discs at F4, F5, F6 (vertically) and E6 (diagonally). It is important to remember that you may only flip discs that lie between the disc you have just placed and another of your colour already on the board. Taking the previous example of a white move at 10, after white has flipped the 4 discs mentioned the black discs at C4, D4 and E4 now lie between the white disc at B4 and a disc you have just flipped at F4. However, you may NOT flip the discs at C4, D4 and E4, even though they are now trapped between two white discs, because neither of the two white discs were played on this turn. Any discs flipped must lie in a continuous line between the disc you have just placed and another disc of your colour already on the board. For example, a white move at 7 flips the black discs at B5 and C5 since they lie between the disc you have just placed (A5) and a disc already on the board (D5). However, you may NOT flip the disc at F5, even though it lies between A5 and G5, because it does not lie in a continuous line from the disc you have just placed.",
	"image": "board1.gif"
}, {
	"title": "Wining the Game",
	"text": "Play continues alternately. First black, then white. If at any time a player does not have a legal move i.e. there is nowhere he can play that flips one of his opponent's discs, he must pass and his opponent plays again. It is possible to pass several times in succession. When neither player has a legal move (usually when the board is full but not always) the game ends. The winner is the player with the most pieces of his colour showing.",
	"image": ""
}]
